*>COPY REPLACING 外部ファイルの内容を一部置き換える
IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_1_COPY_REPLACING.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        COPY File1 REPLACING ==()== BY ==ITEM==.
PROCEDURE DIVISION.
    MOVE "COPY TEST 2." TO ITEM_DATA_3
    DISPLAY "ITEM_DATA_3:"ITEM_DATA_3
    STOP RUN.
*>COPY 外部ファイル名 REPLACING ==置き換え前文字列== BY ==置き換え後文字列==
*>外部ファイルの一部を置換して挿入