*>小数点以下の計算
IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_10_DECIMAL.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 DECIMAL_DATA.
            05 DEC_A PIC 9(4)V9(5) VALUE 1234.12345.
            05 DEC_B PIC 9(2)V9(5) VALUE 10.12345.
            05 SUM_DATA PIC 9(5)V9(5).
PROCEDURE DIVISION.
    *>ADD
    COMPUTE SUM_DATA = DEC_A + DEC_B.
    DISPLAY "ADD:"SUM_DATA.
    *>SUBTRACT
    COMPUTE SUM_DATA = DEC_A - DEC_B.
    DISPLAY "SUBTRACT:"SUM_DATA.
    *>MULTIPLICATION
    COMPUTE SUM_DATA = DEC_A * DEC_B.
    DISPLAY "MULTI:"SUM_DATA.
    *>DIVISION
    COMPUTE SUM_DATA = DEC_A / DEC_B.
    DISPLAY "DIVISION:"SUM_DATA.
    
    STOP RUN.
*>COBOLは小数点の計算でも、桁数を明示的に定義できて正確に行うことができる
*>PIC 9(4)V9(5).
*>整数4桁小数点以下5桁

