*>EXTERNAL 異なるプログラム間でデータを共有する
IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_3_EXTERNAL.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WORKI_ITEM IS EXTERNAL.
            05 WORK_DATA PIC X(50).
PROCEDURE DIVISION.
    MAIN SECTION.
        MOVE "THIS IS A TEST OF DATA SHARING"TO WORK_DATA.
    CALL_PROCEDURE.
        CALL "APPLICATION_3_EXTERNAL_1".
        CALL "APPLICATION_3_EXTERNAL_2".
    DISPLAY_PROCEDURE.       
        DISPLAY "APPLICATION_3_EXTERNAL:"WORK_DATA.
    END_PROCEDURE.
        STOP RUN.

IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_3_EXTERNAL_1.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WORKI_ITEM IS EXTERNAL.
            05 WORK_DATA PIC X(50).
PROCEDURE DIVISION.
    DISPLAY "APPLICATION_3_EXTERNAL_1:"WORK_DATA.
    GOBACK.
END PROGRAM APPLICATION_3_EXTERNAL_1.

IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_3_EXTERNAL_2.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WORKI_ITEM IS EXTERNAL.
            05 WORK_DATA PIC X(50).
PROCEDURE DIVISION.
    DISPLAY "APPLICATION_3_EXTERNAL_2:"WORK_DATA.
    MOVE "CHANGE SHARED DATA."TO WORK_DATA.
    GOBACK.
END PROGRAM APPLICATION_3_EXTERNAL_2.
*>EXTERNAL句を指定したデータ項目や集団項目は、プログラムの実行単位中の、
*>レコードデータを記述する全てのプログラム間でデータを共有する
*>01 データ項目 IS EXTERNAL
*>データ項目を共有する
*>FD ファイル項目 IS EXTERNAL.
*>ファイルを共有する
*>一つの実行単位の中で、複数のプログラムが同じデータを共有する場合は、
*>関連するレコード記述項の各レコード名は、同じ名前で定義する必要がある
*>EXTERNAL句を指定した項目やその配下の基本項目にVALUE句を指定することはできない
