*>COPY プログラムの任意の箇所に、指定したファイルの内容を挿入することができる
IDENTIFICATION DIVISION.
PROGRAM-ID. APPLICATION_0_COPY.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    COPY File1.
PROCEDURE DIVISION.
    MOVE "COPY TEST" TO ITEM-DATA-1.
    MOVE 100 TO NUM-1.
    DISPLAY "ITEM-DATA-1:"ITEM-DATA-1.
    DISPLAY "NUM-1:"NUM-1.
    STOP RUN.
*>COPY 外部ファイル名.
*>外部ファイルをそのまま挿入
*>COPY 外部ファイル名 REPLACING 置き換え前文字列 BY 置き換え後文字列.
*>外部ファイルの一部を置換して挿入
