*>UNTIL 処理を終了する終了条件を指定できる
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_21_UNTIL.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_KAISU PIC 99 VALUE 10.
        01 WK_SUJI PIC 99 VALUE ZERO.
PROCEDURE DIVISION.
    BEFORE_PROCEDURE.
        PERFORM WITH TEST BEFORE UNTIL WK_SUJI > WK_KAISU
            ADD 1 TO WK_SUJI
        END-PERFORM.
        DISPLAY "BEFORE>>"WK_SUJI.
    AFTER_PROCEDURE.
        PERFORM WITH TEST AFTER UNTIL WK_SUJI > WK_KAISU
            ADD 1 TO WK_SUJI
        END-PERFORM.
        DISPLAY "AFTER>>"WK_SUJI.
        INITIALIZE WK_SUJI.
        STOP RUN.        
*>PERFORM WITH TEST BEFORE UNTIL 条件式
*>PERFORM WITH TEST AFTER UNTIL 条件式
*>条件式を満たすまで処理を続ける
*>BEFOREは処理の最初に判断を行う
*>AFTERは処理の最後に判断を行う
*>WITH TEST BEFOREは省略できる
*>WITH TEST AFTERは省略できない
