*>CALL サブプログラムを呼び出す
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_30_CALL.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 PRM.
            05 WK_DATE PIC X(21).
        01 PRM_1.
            05 WK_NUM PIC 99 VALUE ZERO.
PROCEDURE DIVISION.
    SUB_CALL SECTION.
        CALL "SUB_SAMPLE01KO".
    PASS_BY_VALUE.
        MOVE FUNCTION CURRENT-DATE TO WK_DATE.
        CALL "SUB_SAMPLE02KO" USING BY CONTENT PRM.
        DISPLAY "値渡し引き渡し元:"WK_DATE.
    PASS_BY_REFERENCE.
        DISPLAY "参照渡し引き渡し元:"WK_NUM.
        CALL "SUB_SAMPLE03KO" USING BY REFERENCE PRM_1.
        DISPLAY "引き渡して一を足した後:"WK_NUM.
    END_PROCEDURE.
        STOP RUN.
END PROGRAM GETTING_STARTED_30_CALL.

*>呼び出しサンプル
IDENTIFICATION DIVISION.
PROGRAM-ID. SUB_SAMPLE01KO.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    DISPLAY "CALL SUCCESS.".
    EXIT.
END PROGRAM SUB_SAMPLE01KO.

*>値渡しサンプル
IDENTIFICATION DIVISION.
PROGRAM-ID. SUB_SAMPLE02KO.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    LINKAGE SECTION.
        01 PRM.
            05 WK_DATE PIC X(21).
PROCEDURE DIVISION USING PRM.
    DISPLAY "値渡し引き渡し先:"WK_DATE.
    EXIT.
END PROGRAM SUB_SAMPLE02KO.

*>参照渡しサンプル
IDENTIFICATION DIVISION.
PROGRAM-ID. SUB_SAMPLE03KO.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    LINKAGE SECTION.
        01 PRM_1.
            05 WK_NUM PIC 99.
PROCEDURE DIVISION USING PRM_1.
    ADD 1 TO WK_NUM.
    EXIT.
END PROGRAM SUB_SAMPLE03KO.
*>サブプログラムは、特定の処理を一つの手続きとしてまとめたプログラム
*>CALL プログラム名.
*>値渡しは、メインプログラムで作成したデータを、サブプログラムに渡す
*>サブプログラムでデータを加工しても、メインプログラムのデータ項目には影響はない
*>参照渡しは、データ項目を共通のデータ領域にもつ
*>サブプログラムでデータを加工したら、その結果はメインプログラムにも反映される
*>CALL プログラム名 USING BY CONTENT データ項目
*>値渡し
*>CALL プログラム名 USING BY REFERENCE データ項目

