*>FIXED_ARRAY 固定長配列
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_13_FIXED_ARRAY.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WORK_ITEM_1.
            05 WORK_DATA OCCURS 5.
                10 WORK_ITEM PIC X(10).
PROCEDURE DIVISION.
    MAIN_PROCEDURE.
    INPUT_PROCEDURE.
        MOVE "ITEM1" TO WORK_ITEM(1).
        MOVE "ITEM2" TO WORK_ITEM(2).
        MOVE "ITEM3" TO WORK_ITEM(3).
        MOVE "ITEM4" TO WORK_ITEM(4).
        MOVE "ITEM5" TO WORK_ITEM(5).
    OUTPUT_PROCEDURE.
        DISPLAY "WORK_ITEM(1):" WORK_ITEM(1).
        DISPLAY "WORK_ITEM(2):" WORK_ITEM(2).
        DISPLAY "WORK_ITEM(3):" WORK_ITEM(3).
        DISPLAY "WORK_ITEM(4):" WORK_ITEM(4).
        DISPLAY "WORK_ITEM(5):" WORK_ITEM(5).
    END_PROCEDURE.
        STOP RUN.
*>データ項目 OCCURS 値
*>値の数だけ配列の要素を設定する
*>この下位に設定されたデータ項目に、要素数が反映される