*>ISNUMERIC 数字かアルファベットかを判断する
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_19_ISNUMERIC.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_SUJI PIC 99.
        01 WK_SUJI_X REDEFINES WK_SUJI PIC XX.
        01 WK_EIJI PIC XX.
PROCEDURE DIVISION.
    DISPLAY "PLEASE INPUT TWO NUMBER>>" WITH NO ADVANCING.
    ACCEPT WK_SUJI_X FROM CONSOLE.
    *>画面入力したデータ項目WK_SUJIとの比較
    IF (WK_SUJI IS NUMERIC)
        DISPLAY WK_SUJI;
    END-IF.
    IF (WK_SUJI IS ALPHABETIC)
        DISPLAY "PLEASE NUMBER";
    END-IF.
    DISPLAY "PLEASE INPUT TWO ALPHABET>>" WITH NO ADVANCING.
    ACCEPT WK_EIJI FROM CONSOLE.
    *>画面入力したデータ項目WK_EIJIとの比較
    IF (WK_EIJI IS ALPHABETIC)
        DISPLAY WK_EIJI
    END-IF.
    
    IF (WK_EIJI IS NUMERIC)
        DISPLAY "PLEASE ALPHABET"
    END-IF.
    STOP RUN.
*>データ項目 IS NUMERIC
*>データ項目が、数字かどうかを判断する
*>データ項目 IS ALPHABETIC
*>データ項目が、英文字かどうかを判断する
