*>COMPUTE文 計算処理を行う
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_2_COMPUTE.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 SAMPLE_DATA.
            05 NUM_A PIC 9(3)V9(3) VALUE 130.123.
            05 NUM_B PIC V9(5) VALUE 0.11356.
            05 NUM_C PIC 9(2) VALUE 10.
            05 SUM_DATA PIC 9(3)V9(5).
PROCEDURE DIVISION.
    MAIN_PART SECTION.
        ADD_PART.
            ADD NUM_A NUM_B TO SUM_DATA.
            DISPLAY "ADD:" SUM_DATA.
        SUBTRACT_PART.
            SUBTRACT NUM_A FROM NUM_C GIVING SUM_DATA.
            DISPLAY "SUB:" SUM_DATA.
        MULTIPLY_PART.
            MULTIPLY NUM_A BY NUM_B GIVING SUM_DATA.
            DISPLAY "MUL:" SUM_DATA.
        DIVIDE_PART.
            DIVIDE NUM_A BY NUM_C GIVING SUM_DATA.
            DISPLAY "DIV:" SUM_DATA.
        COMPUTE_PART.
            COMPUTE SUM_DATA = (NUM_A + NUM_B)/SUM_DATA.
            DISPLAY "COM:" SUM_DATA.
    END_PART.
        STOP RUN.
*>ADD データ1 データ2 TO データ3
*>COMPUTE データ3 = データ1 + データ2
*>SUBTRACT データ1 FROM データ2 GIVING データ3
*>COMPUTE データ3 = データ1 - データ2
*>MULTIPLY データ1 BY データ2 GIVING データ3
*>COMPUTE データ3 = データ1 * データ2
*>DIVIDE データ1 BY データ2 GIVING データ3
*>COMPUTE データ3 = データ1 / データ2
