*>IS NUMERIC指定したデータ項目が数字かどうか判断する
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_32_NUMERIC.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_SUJI PIC 99.
        01 WK_SUJI_X REDEFINES WK_SUJI PIC XX.
PROCEDURE DIVISION.
    DISPLAY "PLEASE INPUT TWO NUMBER.>>"WITH NO ADVANCING.
    ACCEPT WK_SUJI_X FROM CONSOLE.
    IF (WK_SUJI IS NUMERIC)
        THEN
            DISPLAY "INPUT NUMBER "WK_SUJI" .";
        ELSE
            DISPLAY "PLEASE INPUT."
    END-IF.
    STOP RUN.
*>データ項目 IS NUMERIC
*>指定したデータ項目が、数字かどうかを判断する

