IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_18_PNCOMPARISON.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_SUJI_1 PIC S9 VALUE 1.
        01 WK_SUJI_2 PIC S9 VALUE 0.
        01 WK_SUJI_3 PIC S9 VALUE -1.
PROCEDURE DIVISION.
    *>正のデータ項目(WK_SUJI_1)との比較
    IF (WK_SUJI_1 IS POSITIVE)
        DISPLAY "WK_SUJI_1 IS SEI"
    END-IF.
    IF (WK_SUJI_1 IS NEGATIVE)
        DISPLAY "WK_SUJI_1 IS FU"
    END-IF.
    IF (WK_SUJI_1 IS ZERO)
        DISPLAY "WK_SUJI_1 IS ZERO"
    END-IF.
    *>ゼロのデータ項目(WK_SUJI_1)との比較
    IF (WK_SUJI_2 IS POSITIVE)
        DISPLAY "WK_SUJI_2 IS SEI"
    END-IF.
    IF (WK_SUJI_2 IS NEGATIVE)
        DISPLAY "WK_SUJI_2 IS FU"
    END-IF.
    IF (WK_SUJI_2 IS ZERO)
        DISPLAY "WK_SUJI_2 IS ZERO"
    END-IF.
    *>負のデータ項目(WK_SUJI_1)との比較
    IF (WK_SUJI_3 IS POSITIVE)
        DISPLAY "WK_SUJI_3 IS SEI"
    END-IF.
    IF (WK_SUJI_3 IS NEGATIVE)
        DISPLAY "WK_SUJI_3 IS FU"
    END-IF.
    IF (WK_SUJI_3 IS ZERO)
        DISPLAY "WK_SUJI_3 IS ZERO"
    END-IF.
    STOP RUN.

*>データ項目 IS POSITIVE
*>データ項目が、ゼロより大きい
*>データ項目 IS NEGATIVE
*>データ項目が、ゼロより小さい
*>データ項目 IS ZERO
*>データ項目がゼロとイコール
