*>文字列の連結
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_24_LINKING.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_MOJI PIC X(06) VALUE SPACE.
        01 WK_MOJI_1 PIC X(03) VALUE '123'.
        01 WK_MOJI_2 PIC X(03) VALUE '456'.
        01 WK_LINK.
            05 WK_LINK_1 PIC X(03) VALUE 'ABC'.
            05 WK_LINK_2 PIC X(03) VALUE 'DEF'.
PROCEDURE DIVISION.
    STRING WK_MOJI_1 WK_MOJI_2
        DELIMITED BY SIZE INTO WK_MOJI.
    DISPLAY WK_MOJI.
    DISPLAY WK_LINK.
    STOP RUN.
*>STRING データ項目1 データ項目2 … DELIMITED BY SIZE INTO データ項目3 (WITH POINTER 開始文字位置)
*>データ項目3にデータ項目1 2 … を格納する(連結)
*>01 集団項目 05 基本項目1 05 基本項目2 05…
*>集団項目に基本項目の文字列や値が格納されている