*>DELETE文 相対キーで指定して、レコードを削除する
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_9_DELETE.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT SAMPLE_FILE ASSIGN TO "File1"
        ORGANIZATION IS RELATIVE
        ACCESS MODE IS DYNAMIC
        RELATIVE KEY IS KEY_NUM.
DATA DIVISION.
    FILE SECTION.
        FD SAMPLE_FILE.
        01 TEST_RECORD.
            05 OUT_FILE_REC PIC X(50).
    WORKING-STORAGE SECTION.
        01 KEY_NUM PIC 9.
        01 DELETE_NUM PIC 9.
        01 TEST_RECORD_NUM PIC 9 VALUE 5.
        01 HANTEI PIC X.
            88 READ_END VALUE "1".
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    MAKE_FILE.
        OPEN OUTPUT SAMPLE_FILE.
        MOVE 1 TO KEY_NUM.
        PERFORM TEST_RECORD_NUM TIMES
            DISPLAY "PLEASE INPUT" KEY_NUM "/5" WITH NO ADVANCING;
            ACCEPT OUT_FILE_REC;
            WRITE TEST_RECORD
                INVALID KEY
                    DISPLAY "ERROR";
                NOT INVALID KEY
                    DISPLAY "SUCCESS:" OUT_FILE_REC
            END-WRITE
            ADD 1 TO KEY_NUM
        END-PERFORM.
        CLOSE SAMPLE_FILE.
    DELETE_RECORD.
        OPEN I-O SAMPLE_FILE.
        DISPLAY "DELETE KEY INPUT(1-5)" WITH NO ADVANCING.
        ACCEPT DELETE_NUM.
        MOVE DELETE_NUM TO KEY_NUM.
        DELETE SAMPLE_FILE RECORD
            INVALID KEY
                DISPLAY "DELETE ERROR:" KEY_NUM;
            NOT INVALID KEY
                DISPLAY "DELETE SUCCESS:" KEY_NUM;
        END-DELETE.
        CLOSE SAMPLE_FILE.
    READ_FILE.
        DISPLAY "RELATIVE FILE READ."
        OPEN INPUT SAMPLE_FILE.
        PERFORM UNTIL READ_END
            READ SAMPLE_FILE NEXT
                AT END 
                    SET READ_END TO TRUE;
                NOT AT END 
                    DISPLAY OUT_FILE_REC;
            END-READ
        END-PERFORM.
        CLOSE SAMPLE_FILE.
    END_PART.
        DISPLAY "END".
        STOP RUN.
*>削除の相対キー指定はACCEPT文で入力する
*>DELETE文でレコードを削除後に、相対ファイルをREAD文で読み込んで、削除を確認する

