*>PERFORM TIMES 繰り返し処理
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_21_TIMES.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_KAISU PIC 99 VALUE 10.
        01 WK_SUJI PIC 99 VALUE ZERO.
PROCEDURE DIVISION.
    *>指定回数繰り返す処理
    PERFORM WK_KAISU TIMES
        ADD 1 TO WK_SUJI
    END-PERFORM.
    DISPLAY WK_SUJI.
    STOP RUN.
*>PERFORM データ項目 TIMES
*>  繰り返す処理
*>END-PERFORM.
*>データ項目で指定した回数だけ処理を繰り返す
