*>RETURN-CODE サブプログラムと連携時に、あらかじめ宣言されている項目
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_31_RETURN_CODE.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    RETURN_CODE SECTION.
        CALL "SUB_SAMPLE04KO".
        IF RETURN-CODE < ZERO
        THEN
            DISPLAY "ERROR RETURN-CODE:"RETURN-CODE;
        END-IF.
        STOP RUN.
END PROGRAM GETTING_STARTED_31_RETURN_CODE.
*>RETURN-CODE EXE
IDENTIFICATION DIVISION.
PROGRAM-ID. SUB_SAMPLE04KO.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    MOVE -1 TO RETURN-CODE.
    EXIT.
END PROGRAM SUB_SAMPLE04KO.
*>RETURN-CODEはサブプログラムと連携する際に、あらかじめ宣言されている項目
