*>IS ALPHABETIC-LOWER IS ALPHABETIC-UPPER 英小文字か英大文字の判断を行う
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_20_LOWER.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_EIJI PIC XX.
PROCEDURE DIVISION.
    DISPLAY "PLEASE INPUT TWO LOWER ALPHABET>>" WITH NO ADVANCING.
    ACCEPT WK_EIJI FROM CONSOLE.
    *>画面入力したデータ項目WK_EIJIとの比較(1回目)
    IF (WK_EIJI IS ALPHABETIC-LOWER)
        DISPLAY WK_EIJI;
    END-IF.
    IF (WK_EIJI IS ALPHABETIC-UPPER)
        DISPLAY "PLEASE INPUT LOWER ALPHABET";
    END-IF.
    DISPLAY "PLEASE INPUT TWO UPPER ALPHABET>>" WITH NO ADVANCING.
    ACCEPT WK_EIJI FROM CONSOLE.
    *>画面入力したデータ項目WK_EIJIとの比較(2回目)
    IF (WK_EIJI IS ALPHABETIC-UPPER);
        DISPLAY WK_EIJI
    END-IF.
    IF (WK_EIJI IS ALPHABETIC-LOWER)
        DISPLAY "PLEASE INPUT UPPER ALPHABET";
    END-IF.
    STOP RUN.
*>データ項目 IS ALPHABETIC-LOWER
*>データ項目が、英小文字かどうかを判断する
*>データ項目 IS ALPHABETIC-UPPER
*>データ項目が、英大文字かどうかを判断する