*>文字列の比較処理
IDENTIFICATION DIVISION.
PROGRAM-ID. GETTING_STARTED_26_STR_COM.
ENVIRONMENT DIVISION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WK_MOJI PIC X(07) VALUE '123,456'.
        01 WK_SUJI PIC 9.
PROCEDURE DIVISION.
    PERFORM VARYING WK_SUJI FROM 1 BY 1
        UNTIL WK_MOJI(WK_SUJI:1) = ','
    END-PERFORM.
    DISPLAY WK_MOJI(1:WK_SUJI - 1).
    DISPLAY WK_MOJI(WK_SUJI + 1:).
    STOP RUN.
*>WK_SUJIを,が抽出されるまで1づつ増やしていく
*>上記のWK_SUJIを用いて、データ項目の抽出範囲を指定する
*>それにより,の前後の文字を抽出している