*>配列の設定方法
IDENTIFICATION DIVISION.
PROGRAM-ID. TRAINING_6_ARRAY.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 MY_FOODS.
            03 MY_FOOD OCCURS 5 PIC X(5).
PROCEDURE DIVISION.
    MAIN SECTION.
        MOVE "MEAT" TO MY_FOOD(1).
        MOVE "FISH" TO MY_FOOD(2).
        MOVE "SNACK" TO MY_FOOD(3).
        DISPLAY MY_FOOD(1).
        DISPLAY MY_FOOD(2).
        DISPLAY MY_FOOD(3).
        DISPLAY MY_FOOD(4).
        DISPLAY MY_FOOD(5).
        DISPLAY MY_FOODS.
        STOP RUN.
*>OCCURS ここで設定した数だけ配列の数が確保される