*>文字列の入力を受け付ける
IDENTIFICATION DIVISION.
PROGRAM-ID. TRAINING_8_ACCEPT.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 ACCEPT_DATA PIC X(20).
PROCEDURE DIVISION.
    MAIN SECTION.
        DISPLAY "YOUR NAME?".
        ACCEPT ACCEPT_DATA.
        DISPLAY "HELLO " ACCEPT_DATA.
        STOP RUN.
*>ACCEPT キーボードでの入力や、日付や時間などを受け付ける