*>指定した文字をディスプレイに表示する
IDENTIFICATION DIVISION.
PROGRAM-ID. TRAINIG_0_DISPLAY.
PROCEDURE DIVISION.
    MAIN SECTION.
        DISPLAY    "TRAINIG_0_DISPLAY".
        STOP RUN.

*>DISPLAY ディスプレイを含む出力表示を操作するための命令文