*>cobolにおけるコメントの記入方法
IDENTIFICATION DIVISION.
PROGRAM-ID. TRAINING_0_COMMENT.
ENVIRONMENT DIVISION.
PROCEDURE DIVISION.
    MAIN SECTION.
        DISPLAY "*>でコメントを記入できる".
        *>このようにコメントを記入する
        STOP RUN.
*>アスタリスクと不等号記号の後にコメントを記入できる