*>PERFORM TIMES 指定した回数処理を繰り返す
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_9_TIMES.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 COUNT_0 PIC 99.
        01 SUM_0 PIC 99.
PROCEDURE DIVISION.
    MAIN SECTION.
    INITIALIZE_A.
        MOVE ZERO TO COUNT_0 SUM_0.
    TIMES_A.
        PERFORM 10 TIMES
            ADD 1 TO COUNT_0;
            COMPUTE SUM_0 = SUM_0 + COUNT_0;
        END-PERFORM.
        DISPLAY SUM_0.
        STOP RUN.
*>PERFORM 指定した処理を繰り返す
*>TIMES 繰り返しの数を指定する
