*>文字列の部分参照
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_22_PARTIALREFERENCE.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 CODE_DATA.
        05 CODE_DATA_A PIC X(10).
        05 CODE_DATA_B PIC X(10).
        05 CODE_DATA_C PIC X(10).
        05 CODE_DATA_D PIC X(10).
        05 CODE_DATA_E PIC X(10).
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    INPUT_PART.
        MOVE "XYZ" TO CODE_DATA_A CODE_DATA_B CODE_DATA_C CODE_DATA_D CODE_DATA_E.
        MOVE "00001" TO CODE_DATA_A(4:).
        MOVE "00001" TO CODE_DATA_B(4:3).
        MOVE "99999" TO CODE_DATA_C(2:5).
        MOVE "99999" TO CODE_DATA_D(1 + 2:4).
        MOVE "33333" TO CODE_DATA_E(4 - 1:2 + 2).
    OUTPUT_PART.
        DISPLAY CODE_DATA_A.
        DISPLAY CODE_DATA_B.
        DISPLAY CODE_DATA_C.
        DISPLAY CODE_DATA_D.
        DISPLAY CODE_DATA_E.
    STOP RUN.
*>データ項目(開始位置:終了位置)
*>指定した位置に文字列を入れることができる
*>位置の指定には四則計算を用いることもできる
