*>WRITE文 順ファイルへデータを書き込む
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_29_WRITEFILE.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT DATA_FILE ASSIGN TO "File1"
            FILE STATUS IS DATA_STATUS.
DATA DIVISION.
    FILE SECTION.
    FD DATA_FILE.
    01 DATA_RECORD.
        05 NUMBER_CODE PIC X(5).
        05 BELONGS_CODE PIC X(3).
        05 NAME_CODE PIC X(10).
    WORKING-STORAGE SECTION.
    01 DATA_STATUS PIC XX.
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    INITIALIZE_PART.
        OPEN OUTPUT DATA_FILE.
        IF DATA_STATUS NOT = "00"
            THEN
                CONTINUE;
            ELSE
                PERFORM OUTPUT_PART THRU ENDFILE_PART;
        END-IF.
    END_PART.
        STOP RUN.
    OUTPUT_PART.
        PERFORM 3 TIMES
            DISPLAY "NUMBER_CODE:" WITH NO ADVANCING;
            ACCEPT NUMBER_CODE;
            DISPLAY "BELONGS_CODE:" WITH NO ADVANCING;
            ACCEPT BELONGS_CODE;
            DISPLAY "NAME_CODE" WITH NO ADVANCING;
            ACCEPT NAME_CODE;
            WRITE DATA_RECORD
            END-WRITE
        END-PERFORM.
        DISPLAY DATA_RECORD.
    ENDFILE_PART.
        CLOSE DATA_FILE.
*>データを書き込むには、WRITE文を使用する
*>OUTPUT,EXTENDの2つのモードを使用できる
*>OUTPUT>新規なファイルを作成して、データを書き込む
*>EXTEND>既存のファイルにデータを追加する
*>WRITE レコード名
*>ファイルに書き込むレコードを指定する
*>END-WRITE
*>処理を終了する
