*>UNTIL 終了条件を満たすまで処理を繰り返す
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_10_UNTIL.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 COUNT_DATA PIC 99.
        01 SUM_DATA PIC 99.
PROCEDURE DIVISION.
    MAINPROCESS SECTION.
    INITIALIZE_PART.
        MOVE ZERO TO COUNT_DATA SUM_DATA.
    UNTIL_PART.
        PERFORM UNTIL COUNT_DATA >= 10
            ADD 1 TO COUNT_DATA;
            COMPUTE SUM_DATA = SUM_DATA + COUNT_DATA;
        END-PERFORM.
        DISPLAY SUM_DATA.
        STOP RUN.
*>PERFORM UNTIL 条件
*>終了条件を記述する
*>処理内容を記述
*>END-PERFORM.
*>処理終了