*>MERGE文 二つのファイルを統合する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_32_MERGE.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT HUMAN_RESOURCE_FILE ASSIGN TO "File1".
        SELECT BRANCH_OFFICE_FILE ASSIGN TO "File2".
        SELECT RESULT_FILE ASSIGN TO "File3".
        SELECT MERGE_FILE ASSIGN TO "File1".
DATA DIVISION.
    FILE SECTION.
        FD HUMAN_RESOURCE_FILE.
        01 HUMAN_RESOURCE_RECORD.
            05 EMPLOYEE_CODE PIC X(5).
            05 BELONGS_CODE PIC X(3).
            05 NAME_DATA PIC X(10).
            05 FURIGANA_DATA PIC X(20).
        FD BRANCH_OFFICE_FILE.
        01 BRANCH_OFFICE_RECORD.
            05 EMPLOYEE_CODE PIC X(5).
            05 BELONGS_CODE PIC X(3).
            05 NAME_DATA PIC X(10).
            05 FURIGANA_DATA PIC X(20).
        FD RESULT_FILE.
        01 RESULT_RECORD PIC X(38).
        SD MERGE_FILE.
        01 MERGE_RECORD.
            05 ITEM_A PIC X(5).
            05 BELONGS PIC X(3).
            05 ITEM_B PIC X(10).
            05 NAME_FURIGANA PIC X(20).
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    MEARGE_PART.
        MERGE MERGE_FILE
            ASCENDING NAME_FURIGANA
            DESCENDING BELONGS
            USING HUMAN_RESOURCE_FILE BRANCH_OFFICE_FILE
            GIVING RESULT_FILE.
    END_PART.
        STOP RUN.
*>MEAGE ファイル名1
*>SELECT句で指定された整列併合用ファイルを記述する
*>USING
*>ソート済の入力ファイルを2つ以上指定する
*>GIVING
*>出力ファイルを指定する