*>VARYING データ項目を規則的に変化させる
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_11_VARYING.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 COUNT_DATA PIC 99.
    01 SUM_DATA PIC 99.
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    INITIALIZE_PART.
        MOVE ZERO TO SUM_DATA.
    VARYING_PART.
        PERFORM VARYING COUNT_DATA FROM 1 BY 1 UNTIL COUNT_DATA > 10
            COMPUTE SUM_DATA = SUM_DATA + COUNT_DATA;
        END-PERFORM.
        DISPLAY SUM_DATA.
        STOP RUN.
*>PERFORM VARYING カウンタ FROM 初期値 BY 増加値 終了条件
*>カウンタを初期値から増加値分だけ、終了条件を満たすまで変化させていく
*>処理
*>END-PERFORM.
*>処理終了