*>PIC N() データ項目に日本語を設定する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_13_JAPANESE.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 JAPANESE PIC N(15).
    01 JAPANESE_SUB PIC N(15) VALUE N"代入をする".
    01 JAPANESE_NNN PIC NNNN VALUE N"指定".
PROCEDURE DIVISION.
    MAIN_PART SECTION.
    JAPANESE_PART.
        MOVE N"日本語のテスト" TO JAPANESE.
        DISPLAY JAPANESE.
        DISPLAY JAPANESE_SUB.
        DISPLAY JAPANESE_NNN.
        STOP RUN.
*>PIC N() データ項目に日本語を設定できるようになる
*>日本語は1文字につき2バイト使用する
*>NNで日本語一文字を設定できる