*>UNSTRING文 文字列の分解を行う
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_27_UNSTRING.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 DISASSEMBLY_SOURCE PIC X(20) VALUE "ABC 123,456  *#/-XYZ".
    01 DISASSEMBLY_DESTINATION.
        05 OCCURS 4.
            10 DISASSEMBLY_DATA PIC X(10).
            10 SEPARATION_DATA PIC X(5).
            10 COUNT_DATA PIC 99.
    01 START_POINT PIC 99.
    01 DISASSEMBLY_COUNT PIC 99 VALUE ZERO.
PROCEDURE DIVISION.
    MAIN_PART SECTION.
        INITIALIZE DISASSEMBLY_DESTINATION.
        UNSTRING DISASSEMBLY_SOURCE
            DELIMITED BY SPACE
            INTO
                DISASSEMBLY_DATA(1) DELIMITER IN SEPARATION_DATA(1) COUNT IN COUNT_DATA(1)
                DISASSEMBLY_DATA(2) DELIMITER IN SEPARATION_DATA(2) COUNT IN COUNT_DATA(2)
                DISASSEMBLY_DATA(3) DELIMITER IN SEPARATION_DATA(3) COUNT IN COUNT_DATA(3)
                DISASSEMBLY_DATA(4) DELIMITER IN SEPARATION_DATA(4) COUNT IN COUNT_DATA(4)
            TALLYING IN DISASSEMBLY_COUNT
        END-UNSTRING.
    OUTPUT_PART.
        DISPLAY DISASSEMBLY_DESTINATION.
        DISPLAY DISASSEMBLY_COUNT.
    END_PART.
        STOP RUN.
*>UNSTRING 分解対象
*>分解するデータを指定する
*>DELIMITED BY 区切り文字
*>分解する際の区切となる文字を指定する
*>INTO
*>分解された文字の格納先を指定していく
*>分解先 DELIMITER IN 区切り文字 COUNT IN カウンタ
*>分解先、区切り文字、分解回数の格納について指示をする